### Basic Properties of Pandas

In [1]:
import pandas as pd
import numpy as np

In [3]:
data  = {
    'Name':['smith','john','tom','micky','belly','fizz','ricky','happy'],
    'Age':[20,23,24,25,23,26,28,25],
    'Rating':[3.0,5.0,3.65,2.40,4.0,5.78,2.98,1.00]
}

df = pd.DataFrame(data)
df

    Name  Age  Rating
0  smith   20    3.00
1   john   23    5.00
2    tom   24    3.65
3  micky   25    2.40
4  belly   23    4.00
5   fizz   26    5.78
6  ricky   28    2.98
7  happy   25    1.00

In [4]:
data  = {
    'Name':['smith','john','tom','micky','belly','fizz','ricky','happy'],
    'Age':[20,23,24,25,23,26,28,25],
    'Rating':[3.0,5.0,3.65,2.40,4.0,5.78,2.98,1.00]
}

df = pd.DataFrame(data,index=np.arange(1,9))
df

    Name  Age  Rating
1  smith   20    3.00
2   john   23    5.00
3    tom   24    3.65
4  micky   25    2.40
5  belly   23    4.00
6   fizz   26    5.78
7  ricky   28    2.98
8  happy   25    1.00

In [5]:
# Transpose 
# rows to columns
# columns to rows
df.T

            1     2     3      4      5     6      7      8
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [7]:
a = df.T
a

            1     2     3      4      5     6      7      8
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [10]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Name to Rating
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       3 non-null      object
 1   2       3 non-null      object
 2   3       3 non-null      object
 3   4       3 non-null      object
 4   5       3 non-null      object
 5   6       3 non-null      object
 6   7       3 non-null      object
 7   8       3 non-null      object
dtypes: object(8)
memory usage: 324.0+ bytes

In [11]:
a.index

Index(['Name', 'Age', 'Rating'], dtype='object')

In [12]:
a.columns

Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [15]:
a.head()

            1     2     3      4      5     6      7      8
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [16]:
a.head(2)

          1     2    3      4      5     6      7      8
Name  smith  john  tom  micky  belly  fizz  ricky  happy
Age      20    23   24     25     23    26     28     25

In [18]:
a.head(-2)

          1     2    3      4      5     6      7      8
Name  smith  john  tom  micky  belly  fizz  ricky  happy

In [19]:
a.head(-1)

          1     2    3      4      5     6      7      8
Name  smith  john  tom  micky  belly  fizz  ricky  happy
Age      20    23   24     25     23    26     28     25

In [20]:
a.head(-3)

Empty DataFrame
Columns: [1, 2, 3, 4, 5, 6, 7, 8]
Index: []

In [21]:
a.head(-4)

Empty DataFrame
Columns: [1, 2, 3, 4, 5, 6, 7, 8]
Index: []

In [17]:
a.tail()

            1     2     3      4      5     6      7      8
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [22]:
a.tail(1)

          1    2     3    4    5     6     7    8
Rating  3.0  5.0  3.65  2.4  4.0  5.78  2.98  1.0

In [23]:
a.tail(2)

          1    2     3    4    5     6     7    8
Age      20   23    24   25   23    26    28   25
Rating  3.0  5.0  3.65  2.4  4.0  5.78  2.98  1.0

In [24]:
a.tail(3)

            1     2     3      4      5     6      7      8
Name    smith  john   tom  micky  belly  fizz  ricky  happy
Age        20    23    24     25     23    26     28     25
Rating    3.0   5.0  3.65    2.4    4.0  5.78   2.98    1.0

In [25]:
a.tail(-1)

          1    2     3    4    5     6     7    8
Age      20   23    24   25   23    26    28   25
Rating  3.0  5.0  3.65  2.4  4.0  5.78  2.98  1.0

In [26]:
a.tail(-2)

          1    2     3    4    5     6     7    8
Rating  3.0  5.0  3.65  2.4  4.0  5.78  2.98  1.0

In [27]:
a.tail(-3)

Empty DataFrame
Columns: [1, 2, 3, 4, 5, 6, 7, 8]
Index: []

In [28]:
df

    Name  Age  Rating
1  smith   20    3.00
2   john   23    5.00
3    tom   24    3.65
4  micky   25    2.40
5  belly   23    4.00
6   fizz   26    5.78
7  ricky   28    2.98
8  happy   25    1.00

In [29]:
a.axes
# Return a list representing the axes of the DataFrame.
# It has the row axis labels and column axis labels as the only members.
# They are returned in that order.

[Index(['Name', 'Age', 'Rating'], dtype='object'),
 Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')]

In [30]:
df.axes

[Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64'),
 Index(['Name', 'Age', 'Rating'], dtype='object')]

In [31]:
df.dtypes

Name       object
Age         int64
Rating    float64
dtype: object

In [33]:
df['Name'].dtypes

dtype('O')

In [34]:
df.ndim

2

In [35]:
df.shape

(8, 3)

In [36]:
df.value_counts()

Name   Age  Rating
belly  23   4.00      1
fizz   26   5.78      1
happy  25   1.00      1
john   23   5.00      1
micky  25   2.40      1
ricky  28   2.98      1
smith  20   3.00      1
tom    24   3.65      1
dtype: int64

In [37]:
df.columns

Index(['Name', 'Age', 'Rating'], dtype='object')

In [38]:
df.index

Int64Index([1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [39]:
df.tail()

    Name  Age  Rating
4  micky   25    2.40
5  belly   23    4.00
6   fizz   26    5.78
7  ricky   28    2.98
8  happy   25    1.00

In [40]:
df.head()

    Name  Age  Rating
1  smith   20    3.00
2   john   23    5.00
3    tom   24    3.65
4  micky   25    2.40
5  belly   23    4.00

In [41]:
df.sum()

Name      smithjohntommickybellyfizzrickyhappy
Age                                        194
Rating                                   27.81
dtype: object

In [43]:
df['Age'].sum()

194

In [44]:
df.Age.sum()

194

In [45]:
df['Age']

1    20
2    23
3    24
4    25
5    23
6    26
7    28
8    25
Name: Age, dtype: int64

In [48]:
df[['Age']]

   Age
1   20
2   23
3   24
4   25
5   23
6   26
7   28
8   25

In [49]:
df[df.Age]

KeyError: "None of [Int64Index([20, 23, 24, 25, 23, 26, 28, 25], dtype='int64')] are in the [columns]"

In [46]:
df.loc[:,['Age']]

   Age
1   20
2   23
3   24
4   25
5   23
6   26
7   28
8   25

In [50]:
df['Name','Age']

KeyError: ('Name', 'Age')

In [51]:
df[['Name','Age']]

    Name  Age
1  smith   20
2   john   23
3    tom   24
4  micky   25
5  belly   23
6   fizz   26
7  ricky   28
8  happy   25

In [52]:
df[['Age','Rating']]

   Age  Rating
1   20    3.00
2   23    5.00
3   24    3.65
4   25    2.40
5   23    4.00
6   26    5.78
7   28    2.98
8   25    1.00

In [53]:
df['Age'].sum()

194

In [54]:
df[['Age']].sum()

Age    194
dtype: int64

In [55]:
df['Age'].min()

20

In [56]:
df[['Age']].min()

Age    20
dtype: int64

In [57]:
df.describe()

            Age    Rating
count   8.00000  8.000000
mean   24.25000  3.476250
std     2.37547  1.497464
min    20.00000  1.000000
25%    23.00000  2.835000
50%    24.50000  3.325000
75%    25.25000  4.250000
max    28.00000  5.780000

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8 entries, 1 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Rating  8 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 556.0+ bytes

In [61]:
df[['Age']].meann()

Age    24.25
dtype: float64

In [62]:
df.Age.mean()

24.25

In [65]:
df['Age'].median()

24.5

In [66]:
df.Age.median()

24.5

In [67]:
df[['Age']].median()

Age    24.5
dtype: float64

In [63]:
df[['Age','Rating']].mean()

Age       24.25000
Rating     3.47625
dtype: float64

In [64]:
df['Age','Rating'].mean()

KeyError: ('Age', 'Rating')

In [68]:
df[['Age','Rating']].agg['sum','mean','min']

TypeError: 'method' object is not subscriptable